---
kind: property
id: P:Autodesk.Revit.DB.WorksetConfiguration.IsValidObject
source: html/40020be2-9bc6-20e1-9ca4-410e586a6a91.htm
---
# Autodesk.Revit.DB.WorksetConfiguration.IsValidObject Property

Specifies whether the .NET object represents a valid Revit entity.

## Syntax (C#)
```csharp
public bool IsValidObject { get; }
```

## Returns
True if the API object holds a valid Revit native object, false otherwise.

## Remarks
If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone,
 a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.